Import the required packages with their customary aliases as follows:

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

Use the %matplotlib inline magic command so that your plots show in the notebook without having to call plt.show() every time.

In [6]:
%matplotlib inline

Using the pandas read_csv() method, read the GDP dataset into your notebook as a DataFrame called gdp_df.

Take a look at the first 6 rows.

In [69]:
gdp_df = pd.read_csv('../data/gdp_percapita.csv',nrows=6868)
gdp_df.head(6)

  Country or Area  Year        Value  Value Footnotes
0     Afghanistan  2019  2065.036398              NaN
1     Afghanistan  2018  2033.779002              NaN
2     Afghanistan  2017  2058.383832              NaN
3     Afghanistan  2016  2057.062164              NaN
4     Afghanistan  2015  2068.265904              NaN
5     Afghanistan  2014  2102.385234              NaN

Repeat for the internet use dataset. Call this DataFrame internet_df. Take a look at the first six rows.

In [61]:
internet_df = pd.read_csv('../data/internet_use.csv',nrows=4495)
internet_df.head(6)

     Country or Area  Year     Value  Value Footnotes
4490        Zimbabwe  1997  0.033080              NaN
4491        Zimbabwe  1996  0.016790              NaN
4492        Zimbabwe  1995  0.007684              NaN
4493        Zimbabwe  1994  0.001739              NaN
4494        Zimbabwe  1990  0.000000              NaN

7.Look at the shape of each DataFrame - how many rows? How many columns?

In [54]:
internet_df.info()
gdp_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4495 entries, 0 to 4494
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Country or Area  4495 non-null   object
 1   Year             4495 non-null   int64
 2   Value            4495 non-null   float64
 3   Value Footnotes  948 non-null    float64
dtypes: float64(2), int64(1), object(1)
memory usage: 140.6+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6870 entries, 0 to 6869
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Country or Area  6870 non-null   object
 1   Year             6870 non-null   object
 2   Value            6868 non-null   float64
 3   Value Footnotes  1 non-null      float64
dtypes: float64(2), object(2)
memory usage: 214.8+ KB

8.Take a look at the datatypes for the columns in each DataFrame.

In [53]:
internet_df.info()
gdp_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4495 entries, 0 to 4494
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Country or Area  4495 non-null   object
 1   Year             4495 non-null   int64
 2   Value            4495 non-null   float64
 3   Value Footnotes  948 non-null    float64
dtypes: float64(2), int64(1), object(1)
memory usage: 140.6+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6870 entries, 0 to 6869
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Country or Area  6870 non-null   object
 1   Year             6870 non-null   object
 2   Value            6868 non-null   float64
 3   Value Footnotes  1 non-null      float64
dtypes: float64(2), object(2)
memory usage: 214.8+ KB

9.Take a look at the last 10 rows of each DataFrame in turn.

In [56]:
internet_df.tail(10)

     Country or Area  Year     Value  Value Footnotes
4485        Zimbabwe  2002  3.994356              NaN
4486        Zimbabwe  2001  0.799846              NaN
4487        Zimbabwe  2000  0.401434              NaN
4488        Zimbabwe  1999  0.161676              NaN
4489        Zimbabwe  1998  0.081648              NaN
4490        Zimbabwe  1997  0.033080              NaN
4491        Zimbabwe  1996  0.016790              NaN
4492        Zimbabwe  1995  0.007684              NaN
4493        Zimbabwe  1994  0.001739              NaN
4494        Zimbabwe  1990  0.000000              NaN

In [68]:
gdp_df.tail()

     Country or Area  Year        Value  Value Footnotes
6863        Zimbabwe  1994  3263.934978              NaN
6864        Zimbabwe  1993  3033.504852              NaN
6865        Zimbabwe  1992  3054.889178              NaN
6866        Zimbabwe  1991  3426.598094              NaN
6867        Zimbabwe  1990  3324.348171              NaN

10.Drop the value footnotes column from both DataFrames. Check that this worked as expected.

11.Change the columns for the GDP Per Capita DataFrame to ‘Country’, ‘Year’, and ‘GDP_Per_Capita’.

In [72]:
gdp_df_re = gdp_df.rename(columns ={'Country or Area':'Country','Value':'GDP_Per_Capita'})

12.Change the columns for the Internet Users DataFrame to ‘Country’, ‘Year’, and ‘Internet_Users_Pct’.

In [76]:
internet_df_re = internet_df.rename(columns = {'Country or Area':'Country','Value':'Internet_Users_Pct'})

13.Merge the two DataFrames to one. Merge all rows from each of the two DataFrames. Call the new DataFrame gdp_and_internet_use.

14.Look at the first five rows of your new DataFrame to confirm it merged correctly.

15.Look at the last five rows to make sure the data is clean and as expected.

16.Subset the combined DataFrame to keep only the data for 2004, 2009, and 2014. Check that this happened correctly.

17.Create three new DataFrames, one for 2004, one for 2009, and one for 2014. Give them meaningful names that aren't too long.

18.Which country had the highest percentage of internet users in 2014? What was the percentage?

(Try typing the first 3 letters of your DataFrame name and hitting the tab key for auto-complete options).

19.Which country had the lowest percentage of internet users in 2014? What was the percentage?

20.Repeat for 2004 and 2009.

21.Which country had the highest gdp per capita in 2014? What was the gdp per capita?

22.Which country had the lowest gdp per capita in 2014? What was the gdp per capita?

23.Create some scatterplots:
    
a. 2004 Percent Using the Internet vs GDP Per Capita

b. 2009 Percent Using the Internet vs GDP Per Capita

c. 2014 Percent Using the Internet vs GDP Per Capita

24.Are there differences across years? 

What do the plots tell you about any relationship between these two variables? Enter your observations as a markdown cell.

25.Look at the distribution of gdp per capita values for 2014. Is it unimodal?

26.Look at the distribution of Internet Use for 2014. Is it unimodal?

27.What are the top 5 countries in terms of internet use in 2014?

28.Create a DataFrame called top_5_internet from the combined DataFrame that has all three years for the 5 countries that had the greatest 2014 internet usage. 

You should have 15 rows. Check that this is true.

29.Create a seaborn FacetGrid to show the internet usage trend across the years 2004, 2009, and 2014 for these 5 countries (those with the highest reported internet use in 2014). 
Which country had the greatest growth between 2004 and 2014?

30.Repeat the steps above to look at the trend for the 5 countries with the lowest 2014 internet usage. Which country has consistently had the least internet use?

31.Find the top 5 countries for 2014 in terms of GDP per capita; create a DataFrame to look at 10-year trends (use 2004, 2009, 2014 to look at the 10-year trend) in gdp per capita for the 5 countries with the highest 2014 GDP per capita. Use a seaborn facet grid for this.

32.Repeat this one more time to look at 10-year trend for the 5 countries for 2014 with the lowest GDP per capita.

33.Is there anything surprising or unusual in any of these plots? Searching on the internet, can you find any possible explanations for unusual findings?

Bonus exercise:
Download another data set from the UN data (http://data.un.org/Explorer.aspx) to merge with your data and explore.